NextFOAM-2404/tutorials/incompressible/lumpedPointMotion/building/steady/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // Specify directly (without include) for benefit of the paraview reader
    processor
    {
        type    processor;
        value   uniform (0 0 0);
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    _y
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    y_
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    _z
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    // Ground
    z_
    {
        type            slip;
    }

    "(?i).*building.*"
    {
        type            lumpedPointDisplacement;
        value           uniform (0 0 0);
        controllers     ( vertical );
    }
}

// ************************************************************************* //
